jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Services/service/impl/SdStorageServiceImpl.cpp
    // Use larger blob size for batch mode (up to MAX_BATCH_SAMPLES * SAMPLE_SIZE + metadata)
    uint32_t maxBlobSize = 12 + (MAX_BATCH_SAMPLES * AdcDataModel::SAMPLE_SIZE) + 32;
    fdb_err_t err = fdb_tsdb_init(&self->mTsdb, "sensor", "tsdb", fdbGetTime,
                                   maxBlobSize, NULL);
    if (err != FDB_NO_ERR) {
        printf("[SdStorage] TSDB init failed: %d\n", err);
        vTaskDelete(0);
        return;
    }
    printf("[SdStorage] TSDB init OK, last_time=%lu\n", self->mTsdb.last_time);

    // Seed timestamp
    if (self->mTsdb.last_time > 0) {
        sLastTime = self->mTsdb.last_time;
    }

    // Initialize FlashDB KVDB
    uint32_t kvMaxSize = storage::SdFalAdapter::KVDB_SIZE;
    fdb_kvdb_control(&self->mKvdb, FDB_KVDB_CTRL_SET_SEC_SIZE, &secSize);
    fdb_kvdb_control(&self->mKvdb, FDB_KVDB_CTRL_SET_MAX_SIZE, &kvMaxSize);
    fdb_kvdb_control(&self->mKvdb, FDB_KVDB_CTRL_SET_LOCK, (void *)fdbLock);
    fdb_kvdb_control(&self->mKvdb, FDB_KVDB_CTRL_SET_UNLOCK, (void *)fdbUnlock);

    err = fdb_kvdb_init(&self->mKvdb, "upload", "kvdb", NULL, NULL);
    if (err != FDB_NO_ERR) {
        fdb_tsdb_deinit(&self->mTsdb);
        vTaskDelete(0);
        return;
    }

    self->mDbReady = true;

    // DEBUG: Check stress test config
    printf("[SdStorage] Task started, mStressTestHz=%d\n", self->mStressTestHz);

    // Get initial nonce counter
    self->mNonceCounter = (uint32_t)fdb_tsl_query_count(
        &self->mTsdb, 0, 0x7FFFFFFF, FDB_TSL_WRITE);

    printf("[SdStorage] Initial nonce counter: %lu\n", self->mNonceCounter);

    self->taskLoop();
    vTaskDelete(0);
}

void SdStorageServiceImpl::taskLoop() {
    uint32_t lastDay = 0;
    uint32_t lastSyncTick = xTaskGetTickCount();
    uint32_t lastBatchFlushTick = xTaskGetTickCount();
    uint32_t lastStressTick = xTaskGetTickCount();
    static const uint32_t SYNC_INTERVAL = pdMS_TO_TICKS(30000);       // 30 seconds
    static const uint32_t BATCH_FLUSH_INTERVAL = pdMS_TO_TICKS(5000); // 5 seconds max batch hold

    while (mRunning) {
        // Wait for SensorData with timeout
        BaseType_t triggered = xSemaphoreTake(mWriteSem, pdMS_TO_TICKS(10));

        if (triggered == pdTRUE && mHasPendingSensorData) {
            mHasPendingSensorData = false;
            appendRecord(&mPendingSensorData);
        }

        // Check for ADC data (using flag instead of semaphore to avoid race condition)
        if (mHasPendingAdcData) {
            mHasPendingAdcData = false;
            
            // Process the pending ADC batch (copy data in task context, not ISR/dispatcher)
            if (mPendingAdcBatch.sampleCount > 0) {
                for (uint16_t i = 0; i < mPendingAdcBatch.sampleCount && mAdcBatchCount < MAX_BATCH_SAMPLES; i++) {
                    uint16_t offset = mAdcBatchCount * AdcDataModel::SAMPLE_SIZE;
                    uint16_t srcOffset = i * AdcDataModel::SAMPLE_SIZE;
                    memcpy(&mAdcBatchBuffer[offset], 
                           &mPendingAdcBatch.sampleBuffer[srcOffset], 
                           AdcDataModel::SAMPLE_SIZE);
                    mAdcBatchCount++;
                    mSamplesInWindow++;
                }
            }
            
            // Flush batch if target reached
            if (mAdcBatchCount >= mAdcBatchTarget) {
                flushAdcBatch();
                lastBatchFlushTick = xTaskGetTickCount();
            }
        }

        uint32_t now = xTaskGetTickCount();

        // Stress test: internal dummy writes at configured rate
        if (mStressTestHz > 0) {
            uint32_t stressInterval = pdMS_TO_TICKS(1000 / mStressTestHz);
            if ((now - lastStressTick) >= stressInterval) {
                appendDummyRecord();
                lastStressTick = now;
            }
        }

        // ADC batch stress test: generate simulated 8ch data at target write rate
        if (mAdcStressTestSps > 0 && mAdcBatchTarget > 0) {
            uint32_t adcInterval = pdMS_TO_TICKS(1000 * (uint32_t)mAdcBatchTarget / mAdcStressTestSps);
            if ((now - lastStressTick) >= adcInterval) {
                appendDummyAdcBatch();
                lastStressTick = now;
            }
        }

        // Periodic status print (every 1 second)
        static uint32_t sLastPrintTick = 0;
        if ((now - sLastPrintTick) >= pdMS_TO_TICKS(1000)) {
            sLastPrintTick = now;
            if (mAdcStressTestSps > 0) {
                printf("[SD] Records=%lu Rate=%u/s Samples=%u/s Batch=%u\n",
                       mNonceCounter, mLastRate, mLastSampleRate, mAdcBatchTarget);
            } else {
                printf("[SD] Records=%lu Rate=%u/s\n", mNonceCounter, mLastRate);
            }
        }

        // Periodic batch flush (avoid holding samples too long)
        if (mAdcBatchCount > 0 &&
            (now - lastBatchFlushTick) >= BATCH_FLUSH_INTERVAL) {
            flushAdcBatch();
            lastBatchFlushTick = now;
        }

        // Periodic SD sync
        if ((now - lastSyncTick) >= SYNC_INTERVAL) {
            mFal.sync();
            lastSyncTick = now;
        }

        // Midnight auto-export
        if (SystemClock::getInstance().isSynced()) {
            uint32_t today = SystemClock::dateYYYYMMDD(
                SystemClock::getInstance().now());
            if (lastDay != 0 && today != lastDay) {
                exportDailyFile(lastDay);
            }
            lastDay = today;
        }
    }
}

void SdStorageServiceImpl::appendRecord(const SensorDataModel* model) {
    static uint32_t sErrCnt = 0;
    if (!mDbReady) {
        if (++sErrCnt <= 5) printf("[SdStorage] appendRecord: mDbReady=false\n");
        return;
    }

    uint8_t blob[BLOB_SIZE];
    uint8_t* nonce = blob;
    uint8_t* payload = blob + 12;

    uint32_t tick = (uint32_t)xTaskGetTickCount();
    makeNonce(nonce, mNonceCounter, tick);

    serializePayload(model, payload);
    crypto::ChaCha20::crypt(sKey, nonce, 0, payload, PAYLOAD_SIZE);

    struct fdb_blob fblob;
    fdb_err_t err = fdb_tsl_append(&mTsdb, fdb_blob_make(&fblob, blob, BLOB_SIZE));
    if (err == FDB_NO_ERR) {
        mNonceCounter++;
        mWritesInWindow++;
        updateStats();
    } else {
        if (++sErrCnt <= 20) {
            printf("[SdStorage] fdb_tsl_append error: %d at nonce=%lu\n", err, mNonceCounter);
        }
    }
}

void SdStorageServiceImpl::appendAdcSample(const AdcDataModel* model) {
    if (!mDbReady) return;

    // Add sample to batch buffer
    uint16_t sampleBytes = model->activeChannels * AdcDataModel::BYTES_PER_CHANNEL;
    
    if (mAdcBatchCount == 0) {
        mAdcBatchFirstTime = model->firstTimestamp;
    }

